{
    "E/I": [
        "Is feel energized when talking to many people.",
        "I enjoy being the center of attention.",
        "I get excited about attending social events.",
        "I feel drained after spending time alone for too long.",
        "I am comfortable introducing myself to new people.",
        "I prefer group activities over working alone.",
        "I am often described as outgoing and talkative.",
        "I enjoy having lively discussions with friends.",
        "I seek opportunities to meet new people.",
        "I enjoy collaborating on group projects.",
        "I feel motivated by spending time with others.",
        "I thrive in environments with a lot of interaction.",
        "I like making plans to go out on weekends.",
        "I feel restless if I don’t socialize for a while.",
        "I am energized by public speaking opportunities.",
        "I find it easy to share personal stories in a group.",
        "I often strike up conversations with strangers.",
        "I feel most alive when I am surrounded by people.",
        "I enjoy being a leader in social settings.",
        "I find it easy to make new friends quickly.",
        "I prefer working in a busy and collaborative office.",
        "I gain inspiration from brainstorming sessions with others.",
        "I enjoy attending large gatherings like parties or conferences.",
        "I feel confident when participating in group discussions.",
        "I value the energy of group settings over solitude.",
        "I seek out events that allow me to socialize.",
        "I feel lonely if I spend too much time by myself.",
        "I prefer spontaneous plans with friends over solo activities.",
        "I often speak more than I listen in conversations.",
        "I enjoy hosting events at my home.",
        "I prefer being surrounded by people when I work.",
        "I am described as lively and expressive.",
        "I frequently check in with friends to catch up.",
        "I feel more productive when working alongside others.",
        "I initiate group outings or activities with friends.",
        "I find it easy to keep a conversation going.",
        "I actively seek new opportunities to network.",
        "I prefer spending evenings out rather than staying in.",
        "I like to bounce ideas off of other people.",
        "I often volunteer to take charge of team projects.",
        "I enjoy meeting people from diverse backgrounds.",
        "I prefer talking to people over text rather than being silent.",
        "I find comfort in crowds or busy spaces.",
        "I enjoy entertaining people with my stories.",
        "I naturally take the lead in conversations.",
        "I seek validation from engaging with others.",
        "I am described as someone who lights up a room.",
        "I find solitude difficult to tolerate.",
        "I plan social events far in advance to stay connected."
    ],
    "S/N": [
        "I prefer practical solutions to imaginative ideas.",
        "I notice the details in my environment more than abstract patterns.",
        "I trust facts and evidence over speculation.",
        "I focus on what is rather than what could be.",
        "I prefer step-by-step instructions over vague guidelines.",
        "I value hands-on experience over theoretical discussions.",
        "I focus on the present rather than the distant future.",
        "I rely on my five senses to understand the world.",
        "I notice small changes in my surroundings quickly.",
        "I remember specifics rather than general impressions.",
        "I prefer working with tangible tools over abstract concepts.",
        "I find it easy to follow established procedures.",
        "I value traditions and proven methods.",
        "I focus on realistic outcomes when planning.",
        "I find joy in concrete achievements rather than ideas.",
        "I prefer seeing results now rather than later.",
        "I notice small errors or inconsistencies in tasks.",
        "I prioritize immediate needs over future possibilities.",
        "I rely on common sense to make decisions.",
        "I trust my past experiences to guide me.",
        "I value practical skills over abstract learning.",
        "I prefer knowing all the details before starting a project.",
        "I approach problems in a logical, structured way.",
        "I prefer real-world examples over hypothetical scenarios.",
        "I focus on tasks with clear, measurable outcomes.",
        "I appreciate clarity and precision in communication.",
        "I value accuracy and consistency in work.",
        "I prefer following routines and schedules.",
        "I rely on established facts over theories.",
        "I believe in learning by doing rather than imagining.",
        "I take note of what is realistic and achievable.",
        "I value efficiency over creative exploration.",
        "I am thorough and careful in my work.",
        "I notice when something is out of place.",
        "I avoid making assumptions without clear evidence.",
        "I enjoy tasks that involve careful observation.",
        "I prefer proven methods to experimental ones.",
        "I make decisions based on practical considerations.",
        "I appreciate precision and concrete feedback.",
        "I notice and value small details in art or design.",
        "I solve problems through clear and step-by-step processes.",
        "I believe in the importance of clear instructions.",
        "I prefer data-driven decisions to intuitive guesses.",
        "I like tangible accomplishments I can measure.",
        "I see value in tasks that produce immediate results.",
        "I trust structured environments more than flexible ones.",
        "I prefer clear guidelines when working on projects.",
        "I appreciate working on tasks that have defined goals.",
        "I value stability and predictability in daily life."
    ],
    "T/F": [
        "I base decisions on logic rather than emotions.",
        "I value fairness over personal relationships.",
        "I analyze problems objectively to find solutions.",
        "I am not swayed by emotional arguments.",
        "I prioritize efficiency over people's feelings.",
        "I prefer honest feedback over sugarcoating the truth.",
        "I find it easy to stay calm during conflicts.",
        "I believe emotions can cloud judgment.",
        "I approach decisions with critical thinking.",
        "I value direct communication over subtle hints.",
        "I often play the role of a devil's advocate in discussions.",
        "I solve disagreements by focusing on facts.",
        "I respect decisions made through rational analysis.",
        "I think being fair is more important than being kind.",
        "I rarely get caught up in sentimental feelings.",
        "I believe solutions should be practical and logical.",
        "I give constructive criticism to improve outcomes.",
        "I separate emotions from decision-making processes.",
        "I prefer justice over harmony in group settings.",
        "I handle difficult situations with a level head.",
        "I focus on measurable results when evaluating success.",
        "I trust logic more than intuition.",
        "I value consistency in rules and decisions.",
        "I remain calm even when others are upset.",
        "I focus on problem-solving instead of offering sympathy.",
        "I avoid making decisions based on emotional impulses.",
        "I believe in fairness above all else.",
        "I analyze both sides of an argument before deciding.",
        "I focus on achieving the best logical outcome.",
        "I find emotional decisions less reliable than logical ones.",
        "I prioritize practicality when making choices.",
        "I respect rules and structured systems.",
        "I feel more comfortable with clear reasoning than vague feelings.",
        "I believe all problems can be solved rationally.",
        "I think emotions should not influence workplace decisions.",
        "I trust hard evidence when assessing situations.",
        "I provide direct answers even if they are uncomfortable.",
        "I value objectivity over personal opinions.",
        "I solve problems in an organized, systematic manner.",
        "I rarely let emotional reactions control me.",
        "I focus on actionable solutions instead of dwelling on problems.",
        "I prefer debating ideas to sharing personal feelings.",
        "I view emotions as less reliable than facts.",
        "I emphasize long-term solutions over short-term comfort.",
        "I challenge ideas that lack logical foundations.",
        "I approach relationships with a practical mindset.",
        "I admire those who remain calm under pressure.",
        "I take pride in thinking critically about issues.",
        "I make choices that align with reason, not sentiment."
    ],
    "J/P": [
        "I prefer having a structured and organized routine.",
        "I feel uneasy when tasks are left incomplete.",
        "I enjoy making to-do lists and crossing items off.",
        "I prefer planning trips or events in advance.",
        "I get satisfaction from completing tasks before deadlines.",
        "I dislike sudden changes to my schedule.",
        "I like to have decisions finalized as soon as possible.",
        "I prefer a clear, step-by-step approach to projects.",
        "I find comfort in following established procedures.",
        "I value punctuality and reliability in myself and others.",
        "I prefer working on tasks with defined goals and timelines.",
        "I get frustrated when others procrastinate on their duties.",
        "I enjoy organizing my space to improve productivity.",
        "I dislike leaving things open-ended or undecided.",
        "I complete tasks before relaxing or having fun.",
        "I prefer knowing all the details before I start a project.",
        "I feel stressed when things don’t go according to plan.",
        "I prefer clear guidelines over vague instructions.",
        "I thrive when working with a structured timeline.",
        "I stick to my commitments without hesitation.",
        "I enjoy setting measurable goals for myself.",
        "I feel uncomfortable in unpredictable environments.",
        "I prefer making decisions quickly rather than delaying them.",
        "I believe planning ahead avoids unnecessary stress.",
        "I organize my time effectively to meet all responsibilities.",
        "I find satisfaction in sticking to routines.",
        "I dislike working in chaotic or unorganized environments.",
        "I enjoy following a clear schedule every day.",
        "I find it easier to work when I have a strict plan.",
        "I prefer structure and order over spontaneity.",
        "I feel anxious when deadlines are missed.",
        "I prefer making checklists to manage my tasks.",
        "I work best when I follow a fixed routine.",
        "I like knowing what to expect in my daily schedule.",
        "I prioritize tasks to ensure nothing is overlooked.",
        "I dislike environments where roles are undefined.",
        "I appreciate the clarity of detailed planning.",
        "I thrive when I set deadlines for myself.",
        "I prefer orderliness over flexibility in my work environment.",
        "I enjoy checking things off my list as I complete them.",
        "I value predictability in my day-to-day life.",
        "I stick to my plans even if something better comes up.",
        "I prefer resolving issues immediately rather than postponing them.",
        "I avoid last-minute decisions as much as possible.",
        "I dislike working without a clear direction or plan.",
        "I feel most productive when I follow a specific process.",
        "I take pride in my ability to plan ahead.",
        "I believe that discipline leads to better results.",
        "I am uncomfortable leaving things unfinished."
    ]
}